{
  "name": "Synthesis Iridiology",
  "summary": "Синтезирана база от знания по иридология за RAG система\r\nЗаглавие на източника: Recent Advances in Iridology based Disease Detection: A Comprehensive Review\r\nЦел: Да се структурира информацията за използване от AI модел за извличане на информация и генериране на отговори (RAG) в областта на ирисовата диагностика.\r\n1.0 Фундаментални принципи на иридологията\r\nТази секция описва основните теоретични концепции, върху които се гради ирисовата диагностика.\r\n1.1. Неврологична връзка: Ирисът е свързан с всяка част на тялото чрез нервни влакна, които преминават през зрителния нерв, таламуса и гръбначния мозък. Сигналите от органите се \"записват\" в мозъка, а оттам и в ириса, който действа като информационен екран за състоянието на тялото.\r\n1.2. Ирисова карта: Това е топографска схема, която разделя повърхността на ириса на зони, всяка от които съответства на определен орган, жлеза или система в тялото.\r\n1.2.1. Пръстеновидна структура (7 зони): Ирисът се разделя на седем концентрични кръга, като се започне от зеницата навън:\r\nСтомах\r\nЧерва (тънки и дебело черво)\r\nСърце, панкреас, надбъбречни жлези, хипофиза\r\nПростата, матка, костна система\r\nМозък, бял дроб, черен дроб, далак, бъбреци, щитовидна жлеза\r\nМускули, двигателни нерви, лимфна и кръвоносна система\r\nКожа и сетивни нерви.\r\n1.2.2. Секторна структура (Карта-часовник): Ирисът се разделя на 166 сегмента (80 за дясно и 86 за ляво око), подредени като часовников циферблат. Позициите на органите в левия и десния ирис са огледални.\r\n1.3. Диагностични знаци: Клиничната информация се получава чрез изследване на различни маркери в ириса:\r\nЗнаци и петна: Индикация за възпалителни процеси, лезии, тъканни увреждания.\r\nНеобичайни цветове или обезцветявания: Могат да сочат за токсични натрупвания или метаболитни нарушения.\r\n1.4. Етапи на тъканна активност: Анализът на плътността на влакната в ириса показва метаболизма и състоянието на тъканите в 4 етапа:\r\nОстър (Acute): Бели знаци, показват активно възпаление.\r\nПодостър (Subacute): Светлосиви знаци.\r\nХроничен (Chronic): Тъмносиви знаци.\r\nДегенеративен (Degenerative): Черни знаци, показват сериозно увреждане на тъканта.\r\n2.0 Методология за AI-базирана ирисова диагностика\r\nТози раздел описва стъпките, които една компютърна система (AI бот) следва, за да анализира изображение на ирис и да предложи диагностична хипотеза.\r\n2.1. Етап 1: Придобиване на изображение (Dataset Acquisition):\r\nВход: Цифрово изображение на окото, заснето с камера или от специализирана база данни (напр. UBIRIS, CASIA).\r\nИзисквания: Висока резолюция, оптимално разстояние (5 см), ъгъл (0°), осветеност (150-300 Lux) за минимизиране на отраженията и артефактите.\r\n2.2. Етап 2: Предварителна обработка (Image Pre-processing):\r\nЦел: Изолиране и стандартизиране на ириса за точен анализ.\r\nТехники:\r\nЛокализация: Откриване на границите на зеницата и ириса (напр. чрез Circular Hough Transform).\r\nСегментация: Премахване на клепачи, мигли и склера от изображението.\r\nНормализация: Трансформиране на кръглата зона на ириса в правоъгълна форма (модел на Daugman \"rubber sheet\") за улесняване на анализа.\r\nФилтриране: Премахване на шума от изображението (напр. с Median или Gaussian филтри).\r\n2.3. Етап 3: Избор на Зона от Интерес (Region of Interest - ROI):\r\nЦел: Изрязване на конкретния сектор от ирисовата карта, който съответства на диагностицирания орган.\r\n2.4. Етап 4: Извличане на признаци (Feature Extraction):\r\nЦел: Квантифициране на характеристиките на ROI (плътност, цвят, текстура).\r\nПризнаци: Статистически (контраст, корелация, ентропия) и текстурни (GLCM, HOG, LBP), които описват състоянието на тъканта.\r\n2.5. Етап 5: Класификация (Classification):\r\nЦел: Определяне дали ROI е \"нормален\" или \"ненормален\" на база извлечените признаци.\r\nМетоди:\r\nМашинно самообучение (ML): Алгоритми като Support Vector Machine (SVM), Artificial Neural Networks (ANN), Random Forest (RF), Extreme Learning Machine (ELM).\r\nДълбоко самообучение (DL): Невронни мрежи като Convolutional Neural Networks (CNN), които са ефективни при анализ на големи обеми от изображения.\r\n2.6. Етап 6: Диагноза (Diagnosis):\r\nИзход: Системата генерира резултат \"Здрав/Не-здрав\" или хипотеза за конкретно състояние/заболяване с определена вероятност (процент точност).\r\n3.0 База данни \"Болест → Ирисов знак\" (за RAG извличане)\r\nТази секция е директна база от знания за връзката между заболявания и техните проявления в ириса, според прегледаните в статията изследвания.\r\n3.1. Висок холестерол (Хиперхолестеролемия):\r\nЗнак: Наличие на сив или бял пръстен в периферията на ириса (известен като натриев пръстен или arcus senilis).\r\nROI: Външният ръб на ириса.\r\n3.2. Диабет:\r\nЗнак 1: Промени в зоната на панкреаса.\r\nROI 1: Дясно око: между 7 и 8 часа; Ляво око: между 4 и 5 часа.\r\nЗнак 2: \"Кръст на Андреас\" – четири отвора във влакната на ириса.\r\nROI 2: Позиции на 10, 20, 40 и 50 минути спрямо часовниковия циферблат.\r\n3.3. Бъбречни заболявания (Хронична бъбречна недостатъчност):\r\nЗнак: Всяка промяна (петна, шарки) в долната част на ириса.\r\nROI: Дясно око: ~5:30 до 6:00 часа; Ляво око: ~6:00 до 6:30 часа.\r\n3.4. Сърдечни заболявания:\r\nЗнак: Промени в съответния сектор.\r\nROI: Ляво око: между 2 и 3 часа.\r\n3.5. Белодробни заболявания:\r\nЗнак: Петна, наподобяващи бели облачета, или промени в плътността на тъканта, класифицирани според 4-те етапа на активност (виж 1.4).\r\nROI: Дясно око: между 9 и 10 часа; Ляво око: между 2 и 3 часа.\r\n3.6. Чернодробни заболявания:\r\nROI: Дясно око: ъглов диапазон от 235° до 242°.\r\n3.7. Заболявания на далака:\r\nROI: Ляво око: ъглов диапазон от 125° до 132°.\r\n3.8. Стомашни разстройства:\r\nЗнак: Промени в зоната непосредствено около зеницата.\r\nROI: Първият пръстен около зеницата (виж 1.2.1).\r\n4.0 Указания за AI бот за практическо приложение\r\nПри запитване за диагностика:\r\nВход: Потребителят задава въпрос за конкретно състояние (напр. \"Какви са знаците за проблеми с бъбреците в ириса?\") или предоставя изображение.\r\nПроцес:\r\nAI ботът търси ключовата дума (напр. \"бъбреци\") в Секция 3.0 (База данни \"Болест → Ирисов знак\").\r\nИзвлича информацията за Знак и ROI.\r\nГенерира отговор, който описва какво да се търси и къде точно в ириса (ляв/десен, позиция по часовника).\r\nАко потребителят пита за процеса на анализ, ботът може да обясни стъпките от Секция 2.0 (Методология) по опростен начин.\r\nДопълване с външна информация:\r\nБотът може да използва интернет, за да обясни термини като \"Support Vector Machine\", \"Convolutional Neural Network\" или да даде повече информация за анатомията на даден орган.\r\nКлючово правило: Външната информация трябва само да допълва, а не да променя или оспорва данните за иридологичните връзки, дефинирани в този документ.",
  "source": "books/Synthesis Iridiology.txt"
}